app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
	def index
		@gossip = Gossip.all

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Mon premier potin"], ["content", "hihihi c'est rigolo les potins ! 😅"], ["user_id", 1], ["created_at", "2018-11-01 16:56:59.649026"], ["updated_at", "2018-11-01 16:56:59.649026"]]
---
	def create
		if @current_user
			@gossip = Gossip.create!(title: params[:gossip][:title], content: params[:gossip][:content], user_id: @current_user.id)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "potinpotinpotin"], ["updated_at", "2018-11-01 09:08:14.959238"], ["id", 1]]
---
	def update
		@gossip = Gossip.find(params[:id])
		update_params = params.require(:gossip).permit(:title, :content, :anonymous_gossiper)
		@gossip.update(update_params)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 1]]
---
	def destroy
		@gossip = Gossip.find(params[:id])
		if @current_user && @gossip.user_id == @current_user.id
			@gossip.destroy