app/controllers/users_controller.rb

  def check
    @current_user = User.where(email: params[:email], password: params[:password]).last
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 ORDER BY "users"."id" DESC LIMIT $3  [["email", "alexis@gmail.com"], ["password", "azerty"], ["LIMIT", 1]]